import streamlit as st


# ============================================================ 
# НАСТРОЙКА СТРАНИЦЫ 
# ============================================================ 
st.set_page_config( 
    page_title="Главная страница", 
    page_icon="🏠", 
    layout="wide", 
    initial_sidebar_state="expanded" )

# ============================================================
# НАСТРОЙКА НАВИГАЦИИ
# ============================================================

pages = [
    st.Page(
        "pages/Главная страница.py",
        title="🏠 Главная страница"
    ),

    st.Page(
        "pages/Дашборд отгрузки.py",
        title="📊 Дашборд отгрузки"
    ),

    st.Page(
        "pages/Выдача клиенту.py",
        title="📦 Выдача клиенту"
    ),

    st.Page(
        "pages/Разработка.py",
        title="🛠️ Разработка"
    ),

    st.Page(
        "pages/admin.py",
        title="🔐 Администрирование"
    ),

]


# ============================================================
# ЗАПУСК НАВИГАЦИИ
# ============================================================

pg = st.navigation(pages)

pg.run()